module  carry_lookahead_generator_v #(
    parameter   WIDTH = 8
) (
    //  входной сигнал переноса
    input   carry_in,
    //  входные вспомогательные сигналы gi для каждого разряда
    //  =1 - текущий разряд создает перенос
    input   [WIDTH - 1 : 0] generate_in,
    //  входные вспомогательные сигналы pi для каждого разряда
    //  =1 - текущий разряд распр-т перенос
    input   [WIDTH - 1 : 0] propagate_in,
    //  вычисляемые сигналы переноса для каждого разряда
    output  [WIDTH : 1] carry,
    //  групповые сигналы генерации и распр-я, т.к. в реализациях
    //  такой блок является частью сумматора на малое число бит (ex. на 4)
    //  из таких блоков по 4 бита собирается большой сумматор на 32 бита
    //  и в нем стоит CLA 2-го уровня, который по этим сигналам формир-т
    //  carry_in для каждого из таких блоков (логика комбинац, сумма
    //  почти мгновенно пересчитывается, все в рамках такта)
    output  group_generate,
    output  group_propagate
);


//  для вычисления каждого carry[i] мы находим
//  лог сумма (от j = 0 до i) { произведение p{i:j} И gj-1) } +
//  p{0:i} И carry_in

//  вот эти промежутки {a : b} называют интервалами (a - меньший индекс)
//  b - больший
//  для всех наборов {a,b} вводятся индексы v[a,b] = (a + 1) * a / 2 + b

//  временный массив для p{j + 1 : i} - индекс p - это как раз v[a,b]
//  вот мы и создаем массив максимальной разрядности 
wire    [((WIDTH + 1) * WIDTH) / 2 -1 : 0] p_temp;
//  а это для домножения на gj
wire    [((WIDTH + 1) * WIDTH) / 2 -1 : 0] g_temp;
//  этот массив хранит последнее слагаемое для каждого переноса
//  p{0:i} И carry_in
wire    [WIDTH - 1 : 0] c_temp;
//  а этот - первое
//  лог сумма (от j = 0 до i) { произведение p{j+1 : i} И gj) }
wire    [WIDTH - 1 : 0] pg_temp;

//  WIDTH = 4
//  p_temp[5 * 4 / 2 - 1 : 0] = p_temp[9:0]
//  g_temp[9:0]
//  c_temp[3:0]
//  pg_temp[3:0]

//------------------------------------------------------
//  i = 0:
//  j = 0:
//  p_temp[0] = p[0]
//  g_temp[0] = g[0]

//  c_temp[0] = p_temp[0] & carry_in = p[0] & carry_in
//  pg_temp[0] = |g_temp[0 : 0] = g[0]
//  carry[1] = g[0] | p[0] & carry_in
//------------------------------------------------------
//  i = 1:
//  j = 0:
//  p_temp[1] = &p[1:0] = p[1] & p[0]
//  g_temp[1] = g[1]
//  j = 1:
//  p_temp[2] = p[1]
//  g_temp[2] = p[1] & g[0]

//  c_temp[1] = p_temp[1] & carry_in = p[1] & p[0] & carry_in
//  pg_temp[1] = |g_temp[2:1] = p[1] & g[0] | g[1]
//  carry[2] = g[1] | p[1] & g[0] | p[1] & p[0] & carry_in

//------------------------------------------------------
//  i = 2:
//  j = 0:
//  p_temp[3] = &p[2:0] = p[2] & p[1] & p[0]
//  g_temp[3] = g[2]
//  j = 1:
//  p_temp[4] = &p[2:1] = p[2] & p[1]
//  g_temp[4] = p_temp[4] & g[0] = p[2] & p[1] & g[0]
//  j = 2:
//  p_temp[5] = p[2]
//  g_temp[5] = p_temp[5] & g[1] = p[2] & g[1]

//  c_temp[2] = p_temp[3] & carry_in = p[2] & p[1] & p[0] & carry_in
//  pg_temp[2] = |g_temp[5:3] = g[2] | p[2] & g[1] | p[2] & p[1] & g[0]
//  carry[3] = g[2] | p[2] & g[1] | p[2] & p[1] & g[0] | p[2] & p[1] & p[0] & carry_in

//------------------------------------------------------
//  i = 3:
//  j = 0:
//  p_temp[6] = &p[3:0] = p[3] & p[2] & p[1] & p[0]
//  g_temp[6] = g[3]
//  j = 1:
//  p_temp[7] = &p[3:1] = p[3] & p[2] & p[1]
//  g_temp[7] = p[3] & p[2] & p[1] & g[0]
//  j = 2:
//  p_temp[8] = &p[3:2] = p[3] & p[2]
//  g_temp[8] = p[3] & p[2] & g[1]
//  j = 3:
//  p_temp[9] = p[3]
//  g_temp[9] = p[3] & g[2]

//  c_temp[3] = p_temp[6] & carry_in = p[3] & p[2] & p[1] & p[0] & carry_in
//  pg_temp[3] = |g_temp[9:6] = g[3] | p[3] & g[2] | p[3] & p[2] & g[1] | p[3] & p[2] & p[1] & g[0]
//  carry[4] = g[3] | p[3] & g[2] | p[3] & p[2] & g[1] | p[3] & p[2] & p[1] & g[0] | p[3] & p[2] & p[1] & p[0] & carry_in


generate
    genvar i, j;
    //  вот здесь мы вычисляем 
    //  p_temp - это все P{i:j} для текущего i (от j = 0 до i)
    //  g_temp - это P{i:j} домноженное на gj-1
    for (i = 0; i <= WIDTH - 1; i = i + 1) begin : stage
        for (j = 0; j <= i; j = j + 1) begin : block
            assign p_temp[((i+1) * i) / 2 + j] = &propagate_in[i : j];
            case (j)
                0       :   assign g_temp[((i+1) * i) / 2 + j] = generate_in[i];
                default :   assign g_temp[((i+1)*i) / 2 + j] = 
                            p_temp[((i+1) * i) / 2 + j] & generate_in[j-1];
            endcase
        end

        //  считаем второе слагаемое для текущего разряда
        //  это P{i:0} & carry_in
        assign c_temp[i] = p_temp[((i+1) * i) / 2] & carry_in;
        //  и считаем первое
        //  это сумма всех P{i:j} & gj-1
        assign pg_temp[i] = |g_temp[((i+2) * (i+1)) / 2 - 1 : ((i+1) * i) / 2];

        //  наконец вычисляем переносы (объединяем слагаемые)
        assign carry[i+1] = pg_temp[i] | c_temp[i];

    end
endgenerate

//  групповые сигналы определяются последними индексами в данных
//  массивах
//  для 4 бит
//  P{3:0} = p[3] & p[2] & p[1] & p[0]
assign group_propagate = p_temp[(WIDTH * (WIDTH - 1)) / 2];

//  для 4-х бит
//  g[3] | p[3] & g[2] | p[3] & p[2] & g[1] | p[3] & p[2] & p[1] & g[0]
assign group_generate = pg_temp[WIDTH - 1];

endmodule